autoconf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-26 Tue 17:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Autoconf</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Evgeny Posenitskiy, Anthony Scemama" />
<link rel="stylesheet" type="text/css" href="org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Autoconf</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5d0cf44">1. Introduction</a></li>
<li><a href="#org6b608a6">2. Step 1: Makefile</a>
<ul>
<li><a href="#org76f5029">2.1. Possible answer</a></li>
</ul>
</li>
<li><a href="#org8aaa428">3. Step 2: configure.ac</a></li>
<li><a href="#org2d13a22">4. Step 3: Grande finale</a></li>
</ul>
</div>
</div>
<p>
This page contains tutorial on the usage <a href="https://www.gnu.org/software/autoconf/">GNU Autoconf</a>.
This is the first part of the Autotools tutorial.
</p>

<div id="outline-container-org5d0cf44" class="outline-2">
<h2 id="org5d0cf44"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Building software on different platforms is a challenging task.
Re-building it a few years later is even more challenging.
</p>

<p>
Things get more complicated when the project introduces external dependencies
(e.g. libraries that are installed independently and outside of the source tree).
Such dependencies can be located with some built-in tools like <code>pkg-config</code>.
One could then modify the compilation flags to explicitly include installation paths, thus making the code compile on the current machine.
This approach works fine as long as the code has to be compiled only locally and as long as the dependency is not moved to a different directory.
However, the installation paths are likely to be different on another machine and the aforementioned build procedure might break.
</p>

<p>
In this tutorial, we will learn how to configure a particular project using Autoconf.
This project consists of several <code>C++</code> source files, which are compiled into a single program using custom <code>Makefile</code>.
We will learn how to configure and test the <code>C++</code> compiler before building the project.
The source files depend on the <a href="https://portal.hdfgroup.org/display/HDF5/HDF5">HDF5 library</a>, which is a good example of external dependency.
We will learn how to automatically locate the HDF5 library using macros.
</p>

<p>
Below is a source tree of our project. Header and source files can be found in the <code>include/</code> and <code>src/</code> directories, respectively.
The <code>tests/</code> directory contains the <code>test_h5.cpp</code> and <code>dataset.hdf5</code> files needed to test compilation of the aforementioned source code.
</p>

<p>
For this tutorial, the contents of the source and header files are not important.
However, it is worth mentioning that they depend on the HDF5 library, which is not included in the source tree.
The goal is to demonstrate how cumbersome configuration/compilation steps can be facilitated by the use of <b><b>Autoconf</b></b>.
</p>


<div class="org-src-container">
<pre class="src src-text">Sherman-Morrison/
&#9500;&#9472; include/
&#9474;  &#9500;&#9472; Helpers.hpp
&#9474;  &#9500;&#9472; SMWB.hpp
&#9474;  &#9500;&#9472; SM_Maroni.hpp
&#9474;  &#9500;&#9472; SM_Standard.hpp
&#9474;  &#9500;&#9472; Woodbury.hpp
&#9500;&#9472; src/
&#9474;  &#9500;&#9472; Helpers.cpp
&#9474;  &#9500;&#9472; SMWB.cpp
&#9474;  &#9500;&#9472; SM_Maroni.cpp
&#9474;  &#9500;&#9472; SM_Standard.cpp
&#9474;  &#9500;&#9472; Woodbury.cpp
&#9500;&#9472; tests/
&#9474;  &#9500;&#9472; test_h5.cpp
&#9474;  &#9500;&#9472; dataset.hdf5
&#9500;&#9472; bin/
&#9500;&#9472; Makefile
&#9500;&#9472; README.md
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b608a6" class="outline-2">
<h2 id="org6b608a6"><span class="section-number-2">2</span> Step 1: Makefile</h2>
<div class="outline-text-2" id="text-2">
<p>
Let's have a look at the following part of our <code>Makefile</code>:
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #a0522d;">CXX</span>      = g++
<span style="color: #a0522d;">CPPFLAGS</span> = -I./include/ -I/usr/include/hdf5/serial
<span style="color: #a0522d;">CXXFLAGS</span> = -g -O2 -std=c++11
<span style="color: #a0522d;">LDFLAGS</span>  = -L/usr/lib/x86_64-linux-gnu/hdf5/serial
<span style="color: #a0522d;">LIBS</span>     = -lhdf5 -lhdf5_cpp -lpthread -lz
</pre>
</div>

<p>
<b><b>Question:</b></b> What are advantages and disadvantages of the aforementioned definitions?
</p>
</div>

<div id="outline-container-org76f5029" class="outline-3">
<h3 id="org76f5029"><span class="section-number-3">2.1</span> Possible answer</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Here we explicitly require to use the <code>C++</code> compiler to be GNU C++ compiler (<code>g++</code>).
However, what if the compiler is not present on the current machine ?
What if another compiler like <code>icpc</code> of Intel has to be used ?
</p>
</div>
</div>
</div>

<div id="outline-container-org8aaa428" class="outline-2">
<h2 id="org8aaa428"><span class="section-number-2">3</span> Step 2: configure.ac</h2>
</div>

<div id="outline-container-org2d13a22" class="outline-2">
<h2 id="org2d13a22"><span class="section-number-2">4</span> Step 3: Grande finale</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Evgeny Posenitskiy, Anthony Scemama</p>
<p class="date">Created: 2021-10-26 Tue 17:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
